/**
 ******************************************************************************
  * @file       ysf_event.h
  * @author     yearnext
  * @version    1.0.0
  * @date       2017年1月10日
  * @brief      ysf_event 源文件
  * @par        工作平台                                  
  *                 Windows
  * @par        编译平台									                         
  * 				GCC
 ******************************************************************************
  * @note
  * 1.XXXXX                  						                     
 ******************************************************************************
 */

/**
 * @defgroup ysf_event配置
 * @{
 */
/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __YSF_EVENT_H__
#define __YSF_EVENT_H__

/* Add c++ compatibility------------------------------------------------------*/
#ifdef __cplusplus
extern "C"
{
#endif

/* Includes ------------------------------------------------------------------*/
#include "ysf_type.h"
#include "ysf_event_conf.h"

/* Exported macro ------------------------------------------------------------*/
/**
 *******************************************************************************
 * @brief       事件框架调试开关
 *******************************************************************************
 */
#define USE_YNF_EVENT_DEBUG (0)

/**
 *******************************************************************************
 * @brief       事件模块默认工作模式开关
 *******************************************************************************
 */
#define USE_YNF_EVENT_AUTO_MODE (1)

/* Exported types ------------------------------------------------------------*/
/* Exported variables --------------------------------------------------------*/
/* Exported functions --------------------------------------------------------*/
extern ysf_err_t ysf_event_init( void );
extern ysf_err_t ysf_event_send( ysf_event_t );
extern ysf_err_t ysf_event_read( ysf_event_t* );

#ifdef __cplusplus
}
#endif
	
#endif       /** end include define */

/** @}*/     /* YSF_EVENT 配置  */

/**********************************END OF FILE*********************************/
